//--------------------------------------------------------------------------------------------------

// Создаем лог
    var logs = [];
    
// Максимальный размер лога
    var maxCount = 256;
    
//--------------------------------------------------------------------------------------------------

$.log = function(msg) {
    if (typeof msg == 'string' && msg != '') {
    // Удаляем первый элемент
        if (logs.length > maxCount) {
            logs.shift();
        }
        
    // Добавляем новый
        logs.push(msg);
        
    } else {
        var str = '';
        for (var i = logs.length - 1; i >= 0; i--) {
            str += logs[i] + '<br>';
        }
        return str;
    }
    console.log(msg);
};

//--------------------------------------------------------------------------------------------------